Router>
Router>
Router>
Router>
Router>
Router>
Router>
Router>
Router>en
Router#
Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#enable password MYLAB@1
Router(config)#
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#
Router#
Router#exit









Router con0 is now available






Press RETURN to get started.













Router>
Router>
Router>en
Password: 
Password: 
Router#
Router#
Router#
Router#en
Router#sh run
Building configuration...

Current configuration : 717 bytes
!
version 15.1
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Router
!
!
!
enable password MYLAB@1
!
!
!
!
!
!
ip cef
no ipv6 cef
!
!
!
!
license udi pid CISCO2911/K9 sn FTX1524K61V-
!
!
!
!
!
!
!
!
!
!
!
spanning-tree mode pvst
!
!
!
!
!
!
interface GigabitEthernet0/0
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface GigabitEthernet0/1
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface GigabitEthernet0/2
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface Vlan1
 no ip address
 shutdown
!
ip classless
!
ip flow-export version 9
!
!
!
!
!
!
!
!
line con 0
!
line aux 0
!
line vty 0 4
 login
!
!
!
end


Router#
Router#
Router#
Router#
Router#
Router#
Router#
Router#confi t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#service password-en
Router(config)#service password-encryption 
Router(config)#
Router(config)#do sh run
Building configuration...

Current configuration : 725 bytes
!
version 15.1
no service timestamps log datetime msec
no service timestamps debug datetime msec
service password-encryption
!
hostname Router
!
!
!
enable password 7 080C7562283B2546
!
!
!
!
!
!
ip cef
no ipv6 cef

Router(config)#
Router(config)#
Router(config)#
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#